#5. Создайте список из случайных чисел. 
# Найдите максимальное количество его одинаковых элементов.
from collections import Counter

list=Counter([1,4,5,6,7,9,10, 10, 10])
dict(list)
print(list)

#print(list.count(10))

#def similarity():
#    n=int(input("amount of elements: "))
#    for i in range(0,n):
#        list.append(input())
